       IDENTIFICATION DIVISION.
       PROGRAM-ID. SEND-MAIL-MOCK.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 ACTUAL-SUBJECT EXTERNAL  PIC X(100).
       LINKAGE SECTION.
           01 SUBJECT                  PIC X(100).
       PROCEDURE DIVISION USING SUBJECT.
       MAIN-PROCEDURE.
            MOVE SUBJECT TO ACTUAL-SUBJECT.
            GOBACK.
       END PROGRAM SEND-MAIL-MOCK.
